Autodesk.Revit.DB.WorksharingUtils.CheckoutWorksets(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet`1{Autodesk.Revit.DB.WorksetId},Autodesk.Revit.DB.TransactWithCentralOptions)
Obtains ownership for the current user of as many specified worksets as possible.
Remarks:
For best performance, check out all worksets in one big call, rather than many small calls.
document:
The document containing the worksets.
worksetsToCheckout:
The ids of the worksets to attempt to check out.
options:
Options to customize access to the central model.
null is allowed and means no customization.
Returns:
The ids of all specified worksets that are now owned,
including all that were owned prior to the function call.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
document is read-only: It cannot be modified.
-or-
document has an open editing transaction and is accepting changes.
-or-
There are one or more ids with no corresponding workset.
-or-
Saving is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached,
e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model are locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2015

Autodesk.Revit.DB.WorksharingUtils.CheckoutWorksets(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.WorksetId})
Obtains ownership for the current user of as many specified worksets as possible.
Remarks:
For best performance, check out all worksets in one big call, rather than many small calls.
When there comes a contention error when locking the central model, this API would wait and retry
endlessly until getting the lock of the central model.
document:
The document containing the worksets.
worksetsToCheckout:
The ids of the worksets to attempt to check out.
Returns:
The ids of all specified worksets that are now owned,
including all that were owned prior to the function call.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
document is read-only: It cannot be modified.
-or-
document has an open editing transaction and is accepting changes.
-or-
There are one or more ids with no corresponding workset.
-or-
Saving is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached,
e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model are locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.WorksharingUtils.CheckoutElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.TransactWithCentralOptions)
Obtains ownership for the current user of as many specified elements as possible.
Remarks:
For best performance, checkout all elements in one big call, rather than many small calls.
Revit may check out additional elements that are needed to check out the elements you requested.
For example, if you request an element that is in a group, Revit will check out the entire group.
document:
The document containing the elements.
elementsToCheckout:
The ids of the elements to attempt to check out.
options:
Options to customize access to the central model.
null is allowed and means no customization.
Returns:
The ids of all specified elements that are now owned (but possibly out of date),
including all that were owned prior to the function call.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
One or more elements in elementsToCheckout do not exist in the document.
-or-
Saving is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
Editing permissions for the file-based central model could not be accessed for write,
e.g. the network is down, central is missing, or central is read-only.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
Editing permissions for the central model are locked and the last attempt to lock was canceled.
-or-
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
An error has occurred while checking out worksets or elements.
-or-
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2015

Autodesk.Revit.DB.WorksharingUtils.CheckoutElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Obtains ownership for the current user of as many specified elements as possible.
Remarks:
For best performance, checkout all elements in one big call, rather than many small calls.
Revit may check out additional elements that are needed to check out the elements you requested.
For example, if you request an element that is in a group, Revit will check out the entire group.
When there comes a contention error when locking the central model, this API would wait and retry
endlessly until getting the lock of the central model.
document:
The document containing the elements.
elementsToCheckout:
The ids of the elements to attempt to check out.
Returns:
The ids of all specified elements that are now owned (but possibly out of date),
including all that were owned prior to the function call.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
One or more elements in elementsToCheckout do not exist in the document.
-or-
Saving is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
Editing permissions for the file-based central model could not be accessed for write,
e.g. the network is down, central is missing, or central is read-only.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
Editing permissions for the central model are locked and the last attempt to lock was canceled.
-or-
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
An error has occurred while checking out worksets or elements.
-or-
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2014